mathFonseca/CSW41/Laboratório 3 - Maria e Matheus F/Códigos Antigos/Versão Funcionando sem thread/_Exemplo_UTFPR_TM4C1294XL_BoosterPackMKII/ProjectFiles/exemploTIVA.c
	for(j=y; j<y+POINT_HEIGHT; j++){ //y
			for(i=x; i<x+POINT_WIDTH; i++){//x
					pixel = point_start+3*((j-y)*POINT_WIDTH+i-x);
					color = 0x00;
					color += point[pixel+2];
					color += point[pixel+1]*16*16;
					color += point[pixel]*16*16*16*16;
					color += 0x00*16*16*16*16*16*16;
					GrContextForegroundSet(&sContext, color);
					if(color!=ClrBlack)
						draw_pixel(i, j);
			}
	}
}
void draw_Key(uint16_t x, uint16_t y){
	uint32_t i, j;
	uint32_t color, pixel=0;

	for(j=y; j<y+KEY_HEIGHT; j++){ //y
			for(i=x; i<x+KEY_WIDTH; i++){//x
					pixel = key_start+3*((j-y)*KEY_WIDTH+i-x);
					color = 0x00;
					color += key[pixel+2];
					color += key[pixel+1]*16*16;
					color += key[pixel]*16*16*16*16;
					color += 0x00*16*16*16*16*16*16;
					GrContextForegroundSet(&sContext, ClrYellow);
					if(color!=ClrBlack)
						draw_pixel(i, j);
			}
	}
}


void drawBack(uint16_t x, uint16_t y,uint16_t width, uint16_t height){
	uint32_t i, j;
	uint32_t color, pixel;
	
	for(j=y; j<y+height; j++){ //y
		for(i=x; i<x+width; i++){//x
				if(level==1){
						if(j<=INICIO_Y){
								GrContextForegroundSet(&sContext, ClrBlack);
						}
						else{
								pixel = Background_start+3*((j- INICIO_Y)*128+i);
								color = 0x00;
								color += Background[pixel+2];
								color += Background[pixel+1]*16*16;
								color += Background[pixel]*16*16*16*16;
								color += 0x00*16*16*16*16*16*16;
								GrContextForegroundSet(&sContext, color);
								//GrContextForegroundSet(&sContext, ClrBlueViolet);		
						}
						draw_pixel(i, j);
				}
				else if(level==2){
						pixel = Background2_start+3*((j)*128+i);
						color = 0x00;
						color += Background2[pixel+2];
						color += Background2[pixel+1]*16*16;
						color += Background2[pixel]*16*16*16*16;
						color += 0x00*16*16*16*16*16*16;
						GrContextForegroundSet(&sContext, color);	
						draw_pixel(i, j);
				}
				
		}
	}
}
void draw_circle(uint16_t x, uint16_t y){
	GrCircleDraw(&sContext, 
		(sContext.psFont->ui8MaxWidth)*x + (sContext.psFont->ui8MaxWidth)/2, 
		(sContext.psFont->ui8Height+2)*y + sContext.psFont->ui8Height/2 - 1, 
		(sContext.psFont->ui8MaxWidth)/2);
}

void fill_circle(uint16_t x, uint16_t y){
	GrCircleFill(&sContext, 
		(sContext.psFont->ui8MaxWidth)*x + sContext.psFont->ui8MaxWidth/2, 
		(sContext.psFont->ui8Height+2)*y + sContext.psFont->ui8Height/2 - 1, 
		(sContext.psFont->ui8MaxWidth)/2-1);
}

void init_sidelong_menu(){
	uint8_t i;
	GrContextInit(&sContext, &g_sCfaf128x128x16);
	
	GrFlush(&sContext);
	GrContextFontSet(&sContext, g_psFontFixed6x8);
	
	GrContextForegroundSet(&sContext, ClrWhite);
	GrContextBackgroundSet(&sContext, ClrBlack);
	
	//Escreve menu lateral:
	GrStringDraw(&sContext,"Exemplo EK-TM4C1294XL", -1, 0, (sContext.psFont->ui8Height+2)*0, true);
	GrStringDraw(&sContext,"---------------------", -1, 0, (sContext.psFont->ui8Height+2)*1, true);
	GrStringDraw(&sContext,"RGB", -1, 0, (sContext.psFont->ui8Height+2)*2, true);
	GrStringDraw(&sContext,"ACC", -1, 0, (sContext.psFont->ui8Height+2)*3, true);
	GrStringDraw(&sContext,"TMP", -1, 0, (sContext.psFont->ui8Height+2)*4, true);
	GrStringDraw(&sContext,"OPT", -1, 0, (sContext.psFont->ui8Height+2)*5, true);
	GrStringDraw(&sContext,"MIC", -1, 0, (sContext.psFont->ui8Height+2)*6, true);
	GrStringDraw(&sContext,"JOY", -1, 0, (sContext.psFont->ui8Height+2)*7, true);
	GrStringDraw(&sContext,"BUT", -1, 0, (sContext.psFont->ui8Height+2)*8, true);
	GrStringDraw(&sContext,"NOVO ICONE", -1, 0, (sContext.psFont->ui8Height+2)*9, true);

}
	
uint32_t saturate(uint8_t r, uint8_t g, uint8_t b){
	uint8_t *max = &r, 
					*mid = &g, 
					*min = &b,
					*aux, 
					div, num;
	if (*mid > *max){ aux = max; max = mid; mid = aux; }
	if (*min > *mid){ aux = mid; mid = min; min = aux; }
	if (*mid > *max){	aux = max; max = mid; mid = aux; }
	if(*max != *min){
		div = *max-*min;
		num = *mid-*min;
		*max = 0xFF;
		*min = 0x00;
		*mid = (uint8_t) num*0xFF/div;
	}
	return 	(((uint32_t) r) << 16) | 
					(((uint32_t) g) <<  8) | 
					( (uint32_t) b       );
}

/*----------------------------------------------------------------------------
 *      Switch LED on
 *---------------------------------------------------------------------------*/
void Switch_On (unsigned char led) {
  if (led != LED_CLK) led_on (led);
}
/*----------------------------------------------------------------------------
 *      Switch LED off
 *---------------------------------------------------------------------------*/
void Switch_Off (unsigned char led) {
  if (led != LED_CLK) led_off (led);
}





	


/*----------------------------------------------------------------------------
 *      Main
 *---------------------------------------------------------------------------*/


bool button_read_debounce(void) {
	uint8_t i = 0;
	while(i < 50) {
		if(button_read_s1())
			i++;
		else
			return false;
	}
	return true;
}
void InitializeBackGround(){
		uint32_t color = 0x00, i, j, pixel;
	
		if(level==1){
				pixel = Background_start;
				for(j = INICIO_Y; j < 128; j++){ //y
					for(i = 0; i < 128; i++){ //x
						//pixel = Background_start+3*((j-INICIO_Y)*128+i);
						color = 0x00;
						color += Background[pixel+2];
						color += Background[pixel+1]*16*16;
						color += Background[pixel]*16*16*16*16;
						color += 0x00*16*16*16*16*16*16;
						GrContextForegroundSet(&sContext, color);
						draw_pixel(i, j);
						pixel += 3;
					}
				}
		}
		else if(level==2){
				pixel = Background2_start;
				for(j = 0; j < 128; j++){ //y
						for(i = 0; i < 128; i++){ //x
							color = 0x00;
							color += Background2[pixel+2];
							color += Background2[pixel+1]*16*16;
							color += Background2[pixel]*16*16*16*16;
							color += 0x00*16*16*16*16*16*16;
							GrContextForegroundSet(&sContext, color);
							draw_pixel(i, j);
							pixel += 3;
						}
				}
		}
}
void InitializeBacKGround(){
		uint32_t color = 0x00, i, j, pixel,pixel_ed;
		
		pixel = Background_start;
		for(j = INICIO_Y; j < 128; j++){ //y
			for(i = 0; i < 128; i++){ //x
				//pixel = Background_start+3*((j-INICIO_Y)*128+i);
				color = 0x00;
				color += Background[pixel+2];
				color += Background[pixel+1]*16*16;
				color += Background[pixel]*16*16*16*16;
				color += 0x00*16*16*16*16*16*16;
				GrContextForegroundSet(&sContext, color);
				draw_pixel(i, j);
				pixel += 3;
			}
		}

